Repository: cSploit/android
Catalog: cSploit/jni/libiconv/po/*.po
Languages: sr

source: Usage: iconv [-c] [-s] [-f fromcode] [-t tocode] [file ...]
sr: Употреба: iconv [-c] [-s] [-f изкод] [-t укод] [датотека ...]

source: or: iconv -l
sr: или: iconv -l

source: Try `%s --help' for more information.
sr: Покушај „%s --help“ за више информација.

source: Usage: %s [OPTION...] [-f ENCODING] [-t ENCODING] [INPUTFILE...]
sr: Употреба: %s [ОПЦИЈА...] [-f КОД] [-t КОД] [УЛАЗДАТОТЕКА...]

source: or: %s -l
sr: или: %s -l

source: Converts text from one encoding to another encoding.
sr: Претвара текст из једног кодовања у друго.

source: Options controlling the input and output format:
sr: Опције контролисања улазног и излазног формата:

source: -f ENCODING, --from-code=ENCODING the encoding of the input
sr: -f КОДОВАЊЕ, --from-code=КОДОВАЊЕ улазно кодовање

source: -t ENCODING, --to-code=ENCODING the encoding of the output
sr: -t КОДОВАЊЕ, --to-code=КОДОВАЊЕ излазно кодовање

source: Options controlling conversion problems:
sr: Опције контролисања проблема претварања:

source: -c discard unconvertible characters
sr: -c одбаци непретворљиве знакове

source: --unicode-subst=FORMATSTRING substitution for unconvertible Unicode characters
sr: --unicode-subst=ФОРМАТНИСКА замена за непретворљиве Уникод знакове

source: --byte-subst=FORMATSTRING substitution for unconvertible bytes
sr: --byte-subst=ФОРМАТНИСКА замена за непретворљиве бајтове

source: --widechar-subst=FORMATSTRING substitution for unconvertible wide characters
sr: --widechar-subst=ФОРМАТНИСКА замена за непретворљиве широке знакове

source: Options controlling error output:
sr: Опције контролисања исписа грешака:

source: -s, --silent suppress error messages about conversion problems
sr: -s, --silent спречи поруке грешака о проблемима претварања

source: Informative output:
sr: Информативни испис:

source: -l, --list list the supported encodings
sr: -l, --list прикажи подржана кодовања

source: --help display this help and exit
sr: --help прикажи ово објашњење и заврши

source: --version output version information and exit
sr: --version испиши верзију и заврши

source: Report bugs to <bug-gnu-libiconv@gnu.org>.
sr: Пријава грешака на <bug-gnu-libiconv@gnu.org>.

source: Written by %s.
sr: Написао %s.

source: %s argument: A format directive with a variable width is not allowed here.
sr: %s аргумент: Наредба формата са променљивом ширином није овде дозвољена.

source: %s argument: A format directive with a variable precision is not allowed here.
sr: %s аргумент: Наредба формата за променљивом прецизношћу није овде дозвољена.

source: %s argument: A format directive with a size is not allowed here.
sr: %s аргумент: Наредба формата са величином није дозвољена овде.

source: %s argument: The string ends in the middle of a directive.
sr: %s аргумент: Ниска завршава у сред наредбе.

source: %s argument: The character '%c' is not a valid conversion specifier.
sr: %s аргумент: Знак „%c“ неважећи при задавању претварања.

source: %s argument: The character that terminates the format directive is not a valid conversion specifier.
sr: %s аргумент: Завршни знак наредбе формата није важећи за задавање претварања.

source: cannot convert byte substitution to Unicode: %s
sr: не може претворити бајт замене у Уникод: %s

source: cannot convert unicode substitution to target encoding: %s
sr: не може претворити Уникод замену у циљно кодовање: %s

source: cannot convert byte substitution to wide string: %s
sr: не може претворити бајт замене у широку ниску: %s

source: %s:%u:%u: cannot convert
sr: %s:%u:%u: не може претворити

source: %s:%u:%u: incomplete character or shift sequence
sr: %s:%u:%u: непотпуни знаковни или шифт низ

source: %s: I/O error
sr: %s: У/И грешка

source: conversion from %s unsupported
sr: претварање из %s није подржано

source: conversion to %s unsupported
sr: претварање у %s није подржано

source: conversion from %s to %s unsupported
sr: претварање из %s у %s није подржано

source: try '%s -l' to get the list of supported encodings
sr: покушати '%s -l' за списак подржаних кодовања

source: (stdin)
sr: (стдул)

source: I/O error
sr: У/И грешка
